In [50]:
import pandas as pd

In [51]:
data = {
  'co2': [95, 90, 99, 104, 105, 94, 99, 104],
  'model': ['Citigo', 'Fabia', 'Fiesta', 'Rapid', 'Focus', 'Mondeo', 'Octavia', 'B-Max'],
  'car': ['Skoda', 'Skoda', 'Ford', 'Skoda', 'Ford', 'Ford', 'Skoda', 'Ford']
}

df = pd.DataFrame(data)
df

   co2    model    car
0   95   Citigo  Skoda
1   90    Fabia  Skoda
2   99   Fiesta   Ford
3  104    Rapid  Skoda
4  105    Focus   Ford
5   94   Mondeo   Ford
6   99  Octavia  Skoda
7  104    B-Max   Ford

Using Groupby for data aggregation

In [52]:
print(df.groupby(["car"]).agg({'car':'count'}))

       car
car
Ford     4
Skoda    4

Using Groupby for getting mean value

In [53]:
print(df.groupby(["car"]).agg({'co2':'mean'}))

         co2
car
Ford   100.5
Skoda   97.0

In [54]:
print(df.groupby(["car"]).agg({'co2':['mean','sum']}))

         co2
        mean  sum
car
Ford   100.5  402
Skoda   97.0  388

Groupby with multiple column and multiple aggregation function in single statement

In [55]:
print(df.groupby(["car","model"]).agg({'co2':['mean','sum']}))

                 co2
                mean  sum
car   model
Ford  B-Max    104.0  104
      Fiesta    99.0   99
      Focus    105.0  105
      Mondeo    94.0   94
Skoda Citigo    95.0   95
      Fabia     90.0   90
      Octavia   99.0   99
      Rapid    104.0  104

Reset the index and convert it into a dataframe for further processing

In [56]:
grp_df = df.groupby(["car"]).agg({'co2':'sum'}).reset_index(inplace=False)
grp_df

     car  co2
0   Ford  402
1  Skoda  388

Handling multilevel groupby

In [57]:
grp_df = df.groupby(["car","model"]).agg({'co2':['mean','sum']}).reset_index(inplace=False)
grp_df.columns = grp_df.columns.map(''.join)
grp_df

     car    model  co2mean  co2sum
0   Ford    B-Max    104.0     104
1   Ford   Fiesta     99.0      99
2   Ford    Focus    105.0     105
3   Ford   Mondeo     94.0      94
4  Skoda   Citigo     95.0      95
5  Skoda    Fabia     90.0      90
6  Skoda  Octavia     99.0      99
7  Skoda    Rapid    104.0     104

Bonus - Filtering dataframe

In [58]:
ford_cars = df[df['car'] == 'Ford']
ford_cars

   co2   model   car
2   99  Fiesta  Ford
4  105   Focus  Ford
5   94  Mondeo  Ford
7  104   B-Max  Ford

In [59]:
skoda_cars = df[df['car'] == 'Skoda']
skoda_cars

   co2    model    car
0   95   Citigo  Skoda
1   90    Fabia  Skoda
3  104    Rapid  Skoda
6   99  Octavia  Skoda

Multiple filters

In [60]:
df[(df['car'] == 'Skoda') & (df['co2'] > 95)]

   co2    model    car
3  104    Rapid  Skoda
6   99  Octavia  Skoda

Concatination of 2 dataframes

In [61]:
car_df = pd.concat([ford_cars,skoda_cars])

In [62]:
car_df

   co2    model    car
2   99   Fiesta   Ford
4  105    Focus   Ford
5   94   Mondeo   Ford
7  104    B-Max   Ford
0   95   Citigo  Skoda
1   90    Fabia  Skoda
3  104    Rapid  Skoda
6   99  Octavia  Skoda

Joining data

In [64]:
data = {
  'co2': [95, 90, 99, 104, 105, 94, 99, 104],
  'model': ['Citigo', 'Fabia', 'Fiesta', 'Rapid', 'Focus', 'Mondeo', 'Octavia', 'B-Max'],
  'car_id': ['1', '1', '2', '1', '2', '2', '1', '2']
}

car_name = {
  'car_id': [ '1', '2'],
  'car_name': ['Skoda','Ford']
}


df = pd.DataFrame(data)
df_car_name = pd.DataFrame(car_name)

In [65]:
df

   co2    model car_id
0   95   Citigo      1
1   90    Fabia      1
2   99   Fiesta      2
3  104    Rapid      1
4  105    Focus      2
5   94   Mondeo      2
6   99  Octavia      1
7  104    B-Max      2

In [67]:
df_car_name

  car_id car_name
0      1    Skoda
1      2     Ford

In [68]:
df.merge(df_car_name, left_on='car_id', right_on='car_id')

   co2    model car_id car_name
0   95   Citigo      1    Skoda
1   90    Fabia      1    Skoda
2  104    Rapid      1    Skoda
3   99  Octavia      1    Skoda
4   99   Fiesta      2     Ford
5  105    Focus      2     Ford
6   94   Mondeo      2     Ford
7  104    B-Max      2     Ford